app/controllers/n_codes_controller.rb

  def index
    @n_codes = NCode.all
---
SELECT "n_codes".* FROM "n_codes"

  def create
    binding.pry
    @n_code = NCode.new(n_code_params)

    r = FederalRegister::Article.search(:conditions => {:term => @n_code.term})
    r.results.each do |a|
      #Toy#create accepts :document_number, :excerpts, :html_url, :type, :title
      params[:document_number] = a.document_number
      params[:html_url] = a.html_url
      params[:type] = a.type
      params[:title] = a.title
      # params[:n_code_id] = @n_code[:id]
      redirect_to new_n_code_toy_path(:n_code_id, @a, params) and return

      end

    respond_to do |format|
      if @n_code.save
---
INSERT INTO "n_codes" ("created_at", "term", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-09-16 21:23:44.019205"], ["term", "115310"], ["updated_at", "2014-09-16 21:23:44.019205"]]

  def update
    respond_to do |format|
      if @n_code.update(n_code_params)
---
UPDATE "n_codes" SET "term" = ?, "updated_at" = ? WHERE "n_codes"."id" = 1  [["term", "115315"], ["updated_at", "2014-09-16 21:49:07.551488"]]

  def destroy
    @n_code.destroy
---
DELETE FROM "n_codes" WHERE "n_codes"."id" = ?  [["id", 1]]

    def set_n_code
      @n_code = NCode.find(params[:id])
---
SELECT  "n_codes".* FROM "n_codes"  WHERE "n_codes"."id" = ? LIMIT 1  [["id", 1]]