app/controllers/toys_controller.rb

SELECT "toys".* FROM "toys"
---
  def index
    @toys = Toy.all